"""
Список победителей
Длинна трассы — 43872м, а зрители хотят узнать имя победителя.

Нам известны средние скорости трёх фаворитов – Пети, Васи и Толи. Помогите подвести итоги гонки.

Формат ввода
В первой строке записана средняя скорость Пети.
Во второй — Васи.
В третьей — Толи.

Формат вывода
Имена победителей в порядке занятых мест.

Пример 1
Ввод
10
5
7
Вывод
1. Петя
2. Толя
3. Вася
Пример 2
Ввод
5
7
10
Вывод
1. Толя
2. Вася
3. Петя
"""
v1 = int(input())
v2 = int(input())
v3 = int(input())

n1, n2, n3 = "Петя", "Вася", "Толя"

"""
if v1 > v2 and v1 > v3:
    print("1. Петя")
    if v2 > v3:
        print("2. Вася")
        print("3. Толя")
    else:
        print("2. Толя")
        print("3. Вася")
elif v2 > v1 and v2 > v3:
    print("1. Вася")
    if v1 > v3:
        print("2. Петя")
        print("3. Толя")
    else:
        print("2. Толя")
        print("3. Петя")
else:
    print("1. Толя")
    if v1 > v2:
        print("2. Петя")
        print("3. Вася")
    else:
        print("2. Вася")
        print("3. Петя")
"""
"""
if v1 > v2 and v1 > v3:
    w1 = n1
    if v2 > v3:
        w2, w3 = n2, n3
    else:
        w2, w3 = n3, n2
elif v2 > v1 and v2 > v3:
    w1 = n2
    if v1 > v3:
        w2, w3 = n1, n3
    else:
        w2, w3 = n3, n1
else:
    w1 = n3
    if v1 > v2:
        w2, w3 = n1, n2
    else:
        w2, w3 = n2, n1
print(f"1. {w1}\n2. {w2}\n3. {w3}")
"""

a = {v1: 'Петя', v2: 'Вася', v3: 'Толя'}
res = sorted([v1, v2, v3], )[-1::-1]
print('1.', a[res[0]])
print('2.', a[res[1]])
print('3.', a[res[2]])
