"""
Украшение чека
Давайте приведём в порядок чек, который печатали ранее.
Все строки должны быть длиной в 35 символов.

Формат ввода
Название товара;
цена товара;
вес товара;
количество денег у пользователя.
Формат вывода
Красивый чек в формате:

================Чек================
Товар:                    <продукт>
Цена:     <число>кг * <число>руб/кг
Итого:                   <число>руб
Внесено:                 <число>руб
Сдача:                   <число>руб
===================================
Примечание
В данный момент примеры ниже визуализируются неправильно.

Пример 1
Ввод
черешня
2
3
10
Вывод
================Чек================
Товар:                      черешня
Цена:                 3кг * 2руб/кг
Итого:                         6руб
Внесено:                      10руб
Сдача:                         4руб
===================================
Пример 2
Ввод
манго
187
43
8041
Вывод
================Чек================
Товар:                        манго
Цена:              43кг * 187руб/кг
Итого:                      8041руб
Внесено:                    8041руб
Сдача:                         0руб
===================================
"""

product = str(input())
price = int(input())
mass = int(input())
cash = int(input())
cost = mass * price
cashback = cash - cost
space = " "
print("================Чек================")
print(f"Товар:{space * (35 - 6 - len(product))}{product}")
print(f"Цена:{space * (35 - 5 - 11 - (len(str(mass))) - len(str(price)))}{mass}кг * {price}руб/кг")
print(f"Итого:{space * (35 - 6 - 3 - len(str(cost)))}{cost}руб")
print(f"Внесено:{space * (35 - 8 - 3 - len(str(cash)))}{cash}руб")
print(f"Сдача:{space * (35 - 6 - 3 - len(str(cashback)))}{cashback}руб")
print("===================================")